import Vue from "vue";
import Vuex from "vuex";

Vue.use(Vuex);

export default new Vuex.Store({
  state: {
    products: [
      {
        name: "cake",
        title: "Товари з холодильних полок магазину: десерти, сирні вироби",
        position: 1,
        maxDays: false,
        minDays: false,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: ризик підмороження або повільного охолодження",
          },
          {
            text: "В холодильнику Liebherr з технологією PowerCooling: рівномірне охолодження",
          },
        ],
        advantages: [
          {
            text: "Беручи товари з холодної полки магазину, треба не пізніше 2-х годин покласти їх до холодильника, щоб запобігти псуванню.",
          },
          {
            text: "В холодильниках з системою PowerCooling по всій камері підтримується рівномірна температура, а вбудований вентилятор відповідає за швидке охолодження продуктів. ",
          },
          {
            text: "Додаткову надійність зберігання забезпечує технологія віддаленого управління SmartDevice. Вона дозволяє активовувати функцію SupeCool за допомогою смартфона. Уявіть, ви купуєте свіжі продукти в магазині, а холодильник за вашою командою вже готується швидко їх охолодити. ",
          },
          {
            text: "Оптимальні умови для тривалого збереження продуктів такого роду – холодильник Liebherr з технологією PowerCooling.",
          },
          {
            text: "Функція швидкої заморозки SuperFrost",
          },
        ],
      },
      {
        name: "lemon",
        title: "Лимон",
        position: 2,
        maxDays: 30,
        minDays: 20,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: ризик поглинання лимоном сторонніх запахів",
          },
          {
            text: "В холодильнику Liebherr з вентилятором PowerCooling та повітряним фільтром FreshAir:  оптимальне збереження",
          },
        ],
        advantages: [
          {
            text: "Навіть надрізаний лимон в моделях холодильників, де забезпечена оптимальна якість повітря, не буде поглинати сторонніх запахів. ",
          },
          {
            text: "Найкращий спосіб зберегти лимони - нарізати їх у скляну банку. ",
          },
          {
            text: "Лимони можуть залишатися в холодильнику при температурі 7°С протягом місяця.",
          },
          {
            text: "Оптимальні умови для тривалого збереження лимонів – холодильник Liebherr з вентилятором PowerCooling та повітряним фільтром FreshAir. ",
          },
          {
            text: "Функція швидкого охолодження SuperCool",
          },
        ],
      },
      // position 3 blue chese
      {
        name: "сheese",
        title: "Твердий сир",
        position: 4,
        maxDays: 110,
        minDays: 10,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: 10 днів",
          },
          {
            text: "В холодильнику Liebherr з зоною свіжості BioFresh: 110 днів",
          },
          {
            text: "+100 днів",
          },
        ],
        advantages: [
          {
            text: "Тверді та напівтверді розфасовані сири зберігаються 10-15 днів. Подовжити термін зберігання можна, загорнувши сир в харчову плівку або пергаментний папір. ",
          },
          {
            text: "Сир - продукт, що вбирає запахи, тому після відкриття упаковки його краще зберігати в герметичному контейнері або в пергаментному папері – він пропускає достатню кількість світла і повітря. Розмір пергаменту має бути в 2 рази більший, ніж шматок сиру. ",
          },
          {
            text: "Доречі, різні види сирів мають різний термін зберігання в звичайному холодильнику. Так, плавлений - до 3 місяців, м'який вершковий - до 30 днів, так званий «ковбасний» - до 2 місяців, розсольні сири - 30-75 днів, м'який з цвіллю – до 7 днів. ",
          },
          {
            text: "Оптимальні умови для тривалого збереження сирів - холодильник Liebherr, зона BioFresh, контейнер Meat & DairySafe. ",
          },
        ],
      },
      // {
      //   name: "сheese",
      //   title: "Твердий сир",
      //   position: 4,
      //   maxDays: 110,
      //   minDays: 10,
      //   imgUrl: "",
      //   description: [
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //   ],
      //   advantages: [
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //   ],
      // },
      // lemon: {
      //   title: "Лимон",
      //   description: [
      //     {
      //       text: "",
      //     },
      //   ],
      //   advantages: [
      //     {
      //       text: "",
      //     },
      //   ],
      // },
    ],
  },
  mutations: {},
  actions: {},
  getters: {
    getProduct: (state) => {
      return state.products;
    },
  },
  modules: {},
});
