import Vue from "vue";
import Vuex from "vuex";

Vue.use(Vuex);

export default new Vuex.Store({
  state: {
    products: [
      {
        name: "cake",
        title: "Товари з холодильних полок магазину: десерти, сирні вироби",
        position: 1,
        maxDays: false,
        minDays: false,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: ризик підмороження або повільного охолодження",
          },
          {
            text: "В холодильнику Liebherr з технологією PowerCooling: рівномірне охолодження",
          },
        ],
        advantages: [
          {
            text: "Беручи товари з холодної полки магазину, треба не пізніше 2-х годин покласти їх до холодильника, щоб запобігти псуванню.",
          },
          {
            text: "В холодильниках з системою PowerCooling по всій камері підтримується рівномірна температура, а вбудований вентилятор відповідає за швидке охолодження продуктів. ",
          },
          {
            text: "Додаткову надійність зберігання забезпечує технологія віддаленого управління SmartDevice. Вона дозволяє активовувати функцію SupeCool за допомогою смартфона. Уявіть, ви купуєте свіжі продукти в магазині, а холодильник за вашою командою вже готується швидко їх охолодити. ",
          },
          {
            text: "Оптимальні умови для тривалого збереження продуктів такого роду – холодильник Liebherr з технологією PowerCooling.",
          },
          {
            text: "Функція швидкої заморозки SuperFrost",
          },
        ],
      },
      {
        name: "lemon",
        title: "Лимон",
        position: 2,
        maxDays: 30,
        minDays: 20,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: ризик поглинання лимоном сторонніх запахів",
          },
          {
            text: "В холодильнику Liebherr з вентилятором PowerCooling та повітряним фільтром FreshAir:  оптимальне збереження",
          },
        ],
        advantages: [
          {
            text: "Навіть надрізаний лимон в моделях холодильників, де забезпечена оптимальна якість повітря, не буде поглинати сторонніх запахів. ",
          },
          {
            text: "Найкращий спосіб зберегти лимони - нарізати їх у скляну банку. ",
          },
          {
            text: "Лимони можуть залишатися в холодильнику при температурі 7°С протягом місяця.",
          },
          {
            text: "Оптимальні умови для тривалого збереження лимонів – холодильник Liebherr з вентилятором PowerCooling та повітряним фільтром FreshAir. ",
          },
          {
            text: "Функція швидкого охолодження SuperCool",
          },
        ],
      },
      // position 3 blue chese
      {
        name: "сheese",
        title: "Твердий сир",
        position: 4,
        maxDays: 110,
        minDays: 10,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: 10 днів",
          },
          {
            text: "В холодильнику Liebherr з зоною свіжості BioFresh: 110 днів",
          },
          {
            text: "+100 днів",
          },
        ],
        advantages: [
          {
            text: "Тверді та напівтверді розфасовані сири зберігаються 10-15 днів. Подовжити термін зберігання можна, загорнувши сир в харчову плівку або пергаментний папір. ",
          },
          {
            text: "Сир - продукт, що вбирає запахи, тому після відкриття упаковки його краще зберігати в герметичному контейнері або в пергаментному папері – він пропускає достатню кількість світла і повітря. Розмір пергаменту має бути в 2 рази більший, ніж шматок сиру. ",
          },
          {
            text: "Доречі, різні види сирів мають різний термін зберігання в звичайному холодильнику. Так, плавлений - до 3 місяців, м'який вершковий - до 30 днів, так званий «ковбасний» - до 2 місяців, розсольні сири - 30-75 днів, м'який з цвіллю – до 7 днів. ",
          },
          {
            text: "Оптимальні умови для тривалого збереження сирів - холодильник Liebherr, зона BioFresh, контейнер Meat & DairySafe. ",
          },
        ],
      },
      {
        name: "caviar",
        title: "Червона ікра",
        position: 5,
        maxDays: 6,
        minDays: 2,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: 2 дні",
          },
          {
            text: "В холодильнику Liebherr з зоною свіжості BioFresh: 6 днів",
          },
          {
            text: "+4 дні",
          },
        ],
        advantages: [
          {
            text: "Червона ікра продається у бляшаній тарі, але в ній не можна залишати відкритий продукт. Адже під впливом повітря метал швидко окислюється, що негативно позначається на його якості.",
          },
          {
            text: "Відразу після відкриття треба перекласти ікру в іншу ємність. Ідеально підійде скляна баночка з герметичною кришкою. Для цього можна використовувати і пластиковий контейнер, але слід переконатися, що він не має запаху.",
          },
          {
            text: "В жодному разі не можна багаторазово заморожувати і розморожувати ікру - продукт стає небезпечним для вживання.",
          },
          {
            text: "Оптимальні умови для тривалого збереження червоної ікри – холодильник Liebherr, зона BioFresh, контейнер Meat & DairySafe. ",
          },
        ],
      },
      {
        name: "milk",
        title: "Молоко",
        position: 6,
        maxDays: 12,
        minDays: 3,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: 3 дні",
          },
          {
            text: "В холодильнику Liebherr з зоною свіжості BioFresh: 12 днів",
          },
          {
            text: "+9 днів",
          },
        ],
        advantages: [
          {
            text: "Пастеризоване молоко у ємності, що була відкрита, в звичайному холодильнику з третього дня починає втрачати свої поживні цінності та смакові властивості. Більше 5 діб зберігати його не можна. ",
          },
          {
            text: "Відкрите молоко краще перелити в емальовану або скляну ємність з герметичною кришкою,  так воно залишиться свіжим довше, ніж в пакеті. ",
          },
          {
            text: "Дверцята звичайного холодильника - це не краще місце для зберігання молока: продукт вимагає нижчої температури. ",
          },
          {
            text: "Оптимальні умови для тривалого збереження молока – холодильник Liebherr, зона BioFresh, контейнер Meat & DairySafe. ",
          },
        ],
      },
      {
        name: "salad",
        title: "Готові салати, закуски, напої",
        position: 7,
        maxDays: false,
        minDays: false,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: є ризик занадто повільного охолодження ",
          },
          {
            text: "В холодильнику Liebherr з режимом SuperCool: ідеальне охолодження",
          },
        ],
        advantages: [
          {
            text: "SuperCool – функція, що дозволяє автоматично знижувати температуру холодильної камери до + 2 ° C, + 3 ° C або + 4 ° C на 6 або 12 годин в залежності від моделі холодильника. ",
          },
          {
            text: "В таких умовах продукти швидко охолоджуються, виключається ризик підмороження, що властивий деяким звичайним холодильникам.  ",
          },
          {
            text: "Смак і консистенція страв зберігаються.",
          },
          {
            text: "Оптимальні умови для тривалого збереження готових салатів, закусок та напоїв – холодильник Liebherr з режимом SuperCool",
          },
        ],
      },
      {
        name: "pan",
        title: "Борщ",
        position: 8,
        maxDays: false,
        minDays: false,
        imgUrl: "",
        description: [
          {
            text: "В звичайному холодильнику: прискорене псування в моделях з нестабільним температурним фоном",
          },
          {
            text: "В холодильнику Liebherr з режимом SuperCool: швидке охолодження і комфортне зберігання",
          },
        ],
        advantages: [
          {
            text: "Температура в холодильнику не повинна перевищувати 5 ° C. ",
          },
          {
            text: "Гарячу страву не можна ставити в холодильник, краще охолодити до кімнатної температури. ",
          },
          {
            text: "Страву теплу або кімнатної температури накрийте герметичною кришкою, таким чином зменшиться утворення конденсату та льоду у внутрішній камері холодильника. ",
          },
          {
            text: "Заздалегідь активуйте режим SuperCool в холодильнику Liebherr, він допоможе зберегти температуру всередині холодильника на заданому рівні.",
          },
          {
            text: "Оптимальні умови для тривалого збереження готових борщу– холодильник Liebherr з режимом SuperCool",
          },
        ],
      },
      // {
      //   name: "сheese",
      //   title: "Твердий сир",
      //   position: 4,
      //   maxDays: 110,
      //   minDays: 10,
      //   imgUrl: "",
      //   description: [
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //   ],
      //   advantages: [
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //     {
      //       text: "",
      //     },
      //   ],
      // },
    ],
  },
  mutations: {},
  actions: {},
  getters: {
    getProduct: (state) => {
      return state.products;
    },
  },
  modules: {},
});
